# CurveExtents Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CurveExtents Members
CurveExtents Class Methods Properties See Also
---
The CurveExtents type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the CurveExtents |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| EndParameter | The end parameter of the curve extents. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| StartParameter | The start parameter of the curve extents. |

# See Also
CurveExtents Class
Autodesk.Revit.DB Namespace